In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']
users = pd.read_csv('ml-100k/u.user',sep='|',names=u_cols)
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('ml-100k/u.data', sep='\t', names=r_cols)
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']
movies = pd.read_csv('ml-100k/u.item',sep='|',names=m_cols,usecols=range(5))

In [53]:
## SELECT COUNT(1) 

print len(users)
print len(users.index)

print users.user_id.size
print users['user_id'].size

943
943
          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [ ]:
# Inspection

movies
movies.dtypes
users.describe()
print movies.head()
print movies.tail(10)

In [24]:
## How to do a SELECT (SQL) : Column Selection
## SELECT a, b, c FROM table_a 
## In Pandas, you create an array of columns you want to select

cols = ['age','sex']
users[cols].head()

   age sex
0   24   M
1   53   F
2   23   M
3   24   M
4   33   F

In [15]:
#How to do a WHERE clause
#Row selection, through filtering

users[users.age > 55].head()
users[(users.age > 50) & (users.sex == 'F')].head()

     user_id  age sex     occupation zip_code
6          7   57   M  administrator    91344
89        90   60   M       educator    78155
105      106   61   M        retired    55125
110      111   57   M       engineer    90630
130      131   59   F  administrator    15237

In [27]:
#SQL JOINS through pandas.merge 

left_frame = pd.DataFrame({'key': range(5), 
                           'left_value': ['a', 'b', 'c', 'd', 'e']})
right_frame = pd.DataFrame({'key': range(2, 7), 
                           'right_value': ['f', 'g', 'h', 'i', 'j']})

print left_frame
print right_frame
#inner join
print pd.merge(left_frame, right_frame, on="key",how="inner")
#left outer join
print pd.merge(left_frame,right_frame,on="key",how="left")

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e
   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j
   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h
   key left_value right_value
0    0          a         NaN
1    1          b         NaN
2    2          c           f
3    3          d           g
4    4          e           h

In [29]:
# Equivalent of SQL UNION
# pd.concat
# in R: equivalent to rbind, cbind
# axis=0, along the same column names (column index)
# axis = 1 along the same row index 

pd.concat([left_frame,right_frame],axis=1)

   key left_value  key right_value
0    0          a    2           f
1    1          b    3           g
2    2          c    4           h
3    3          d    5           i
4    4          e    6           j

In [64]:
## GROUPING 

## functions available with pandas.groupy
by_occ = users.groupby('occupation')
print by_occ


# count() : Count of NON NULL elemnets
# size() : total records per dept
# sum(): sum of a column
# mean() : avg of a col
# median() : median of a col, e.g.

print by_occ.median().head()

<pandas.core.groupby.DataFrameGroupBy object at 0x104f46b10>
               user_id  age
occupation
administrator    436.0   37
artist           421.5   30
doctor           427.0   45
educator         485.0   42
engineer         467.0   36

In [65]:
# SELECT occupation, COUNT(DISTINCT user_id)
# FROM users
# GROUP BY occupation
# ORDER BY 2 DESC
# LIMIT 5;

print by_occ.user_id.nunique().order(ascending=False)[:5]

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
Name: user_id, dtype: int64